
main.elf:     formato de ficheiro elf32-littleriscv


Desmontagem da secção .text:

80000000 <produto_escalar>:
80000000:	00050793          	mv	a5,a0
80000004:	01c50613          	addi	a2,a0,28
80000008:	00000513          	li	a0,0
8000000c:	0007a703          	lw	a4,0(a5)
80000010:	0005a683          	lw	a3,0(a1)
80000014:	00478793          	addi	a5,a5,4
80000018:	00458593          	addi	a1,a1,4
8000001c:	02d70733          	mul	a4,a4,a3
80000020:	00e50533          	add	a0,a0,a4
80000024:	fec794e3          	bne	a5,a2,8000000c <produto_escalar+0xc>
80000028:	00008067          	ret

Desmontagem da secção .text.startup:

8000002c <main>:
8000002c:	800007b7          	lui	a5,0x80000
80000030:	fb010113          	addi	sp,sp,-80
80000034:	0c478793          	addi	a5,a5,196 # 800000c4 <_end+0xfffff0c4>
80000038:	04112623          	sw	ra,76(sp)
8000003c:	0047a383          	lw	t2,4(a5)
80000040:	0007a083          	lw	ra,0(a5)
80000044:	0087a283          	lw	t0,8(a5)
80000048:	00c7af83          	lw	t6,12(a5)
8000004c:	0107af03          	lw	t5,16(a5)
80000050:	0147ae83          	lw	t4,20(a5)
80000054:	0187ae03          	lw	t3,24(a5)
80000058:	01c7a303          	lw	t1,28(a5)
8000005c:	0207a883          	lw	a7,32(a5)
80000060:	0247a803          	lw	a6,36(a5)
80000064:	0287a603          	lw	a2,40(a5)
80000068:	02c7a683          	lw	a3,44(a5)
8000006c:	0307a703          	lw	a4,48(a5)
80000070:	0347a783          	lw	a5,52(a5)
80000074:	02410593          	addi	a1,sp,36
80000078:	00810513          	addi	a0,sp,8
8000007c:	00112423          	sw	ra,8(sp)
80000080:	00712623          	sw	t2,12(sp)
80000084:	00512823          	sw	t0,16(sp)
80000088:	01f12a23          	sw	t6,20(sp)
8000008c:	01e12c23          	sw	t5,24(sp)
80000090:	01d12e23          	sw	t4,28(sp)
80000094:	03c12023          	sw	t3,32(sp)
80000098:	02612223          	sw	t1,36(sp)
8000009c:	03112423          	sw	a7,40(sp)
800000a0:	03012623          	sw	a6,44(sp)
800000a4:	02c12823          	sw	a2,48(sp)
800000a8:	02d12a23          	sw	a3,52(sp)
800000ac:	02e12c23          	sw	a4,56(sp)
800000b0:	02f12e23          	sw	a5,60(sp)
800000b4:	f4dff0ef          	jal	ra,80000000 <produto_escalar>
800000b8:	04c12083          	lw	ra,76(sp)
800000bc:	05010113          	addi	sp,sp,80
800000c0:	00008067          	ret
