xrun: 23.03-s005: (c) Copyright 1995-2023 Cadence Design Systems, Inc.
TOOL:	xrun	23.03-s005: Started on Oct 20, 2025 at 22:52:48 -03
xrun
	-v2001
	-v93
	-f /home/schultz/Documents/ARQIII_RiscV_Work/tb/tb_core_icarus/filelist.flist
		../../src/core/biriscv_defs.v
		../../src/core/biriscv_alu.v
		../../src/core/biriscv_csr_regfile.v
		../../src/core/biriscv_csr.v
		../../src/core/biriscv_decoder.v
		../../src/core/biriscv_decode.v
		../../src/core/biriscv_divider.v
		../../src/core/biriscv_exec.v
		../../src/core/biriscv_fetch.v
		../../src/core/biriscv_frontend.v
		../../src/core/biriscv_issue.v
		../../src/core/biriscv_lsu.v
		../../src/core/biriscv_mmu.v
		../../src/core/biriscv_multiplier.v
		../../src/core/biriscv_npc.v
		../../src/core/biriscv_pipe_ctrl.v
		../../src/core/biriscv_regfile.v
		../../src/core/biriscv_trace_sim.v
		../../src/core/riscv_core.v
		../../tb/tb_core_icarus/tcm_mem_ram.v
		../../tb/tb_core_icarus/tcm_mem.v
		../../tb/tb_core_icarus/biriscv_trace_sim_gls.sv
		../../tb/tb_core_icarus/tb_top.v
	-access +rwc
	-gui
	-incdir ../../src/core/
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /home/tools/cadence/installs/XCELIUM2303/tools/xcelium/files/xmsimrc
xcelium> database -open waves -into waves.shm -default
Created default SHM database waves
xcelium> probe -create -shm biriscv_trace_sim.opcode_i biriscv_trace_sim.pc_i biriscv_trace_sim.valid_i
Created probe 1
xcelium> run 1000
Starting bench
Ran until 1 US + 0
xcelium> probe -create -shm tb_top.trace_inst_0.dbg_inst_ra tb_top.trace_inst_0.dbg_inst_rb tb_top.trace_inst_0.dbg_inst_rd tb_top.trace_inst_0.dbg_inst_str tb_top.trace_inst_0.opcode_i tb_top.trace_inst_0.ra_idx_w tb_top.trace_inst_0.rb_idx_w tb_top.trace_inst_0.rd_idx_w tb_top.trace_inst_0.valid_i
Created probe 2
xcelium> reset
Loaded snapshot worklib.biriscv_trace_sim:v
xcelium> run 1000
Starting bench
Ran until 1 US + 0
xcelium> ^C
xcelium> exit
TOOL:	xrun	23.03-s005: Exiting on Oct 20, 2025 at 23:00:06 -03  (total: 00:07:18)
